package for_Git;

//아래의 클래스를 직접 작성해 보세요
//1. 필드
//2. 필요에 따라 getter/setter함수  작성
//3. 시나리오에 따라 속성변경 메소드 작성

//1)  상품
//  속성 :  상품명, 가격, 수량
//  행동 :  판매(수량 감소) ,  입고(수량증가),  예약....
//2)  태풍 ( 자연현상 )
//  속성 : 태풍이름 , 번호 , 현재 위치(위도,경도) , 이동속도, 등등...
//  행동 : 이동(위도,경도 변경)
//3)  강의 ( 상황 )
// 속성 : 강좌제목,  강사, 수강생
// 행동 : 시작, 종료, 평가

//4)  예약 ( 행위 )
//  속성 : 시간, 인원, 예약자, 연락처 ,  상태 (예약중, 예약취소)
//  행동 : 예약하기, 예약변경, 취소, 조회

//5)  사람
//속성 :  나이, 몸무게, 혈압, 체온, 혈당, 맥박
//행동 :  생일, 운동, 밥먹기
//=================================================================
//1/7(월) 기술 세미나 : JAVA개발 도구들...
//1/8(화) 기술 세미나 : front-end개발 도구들...(HTML, Javascript)
//1/7~8 스터디 :
//캡슐화 , 데이터은닉, 생성자, static, final , this
//1/10~11 : git
//세미나 결과 :

//1) about git ppt 막내

//2) profile git ppt 잘 만들어진 git 소개  4학년들...

//3) 공통 git 생성 - 과제 수업자료 !!




//https://wikidocs.net/
//=================================================================


public class Semina4_to_5 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
